Tekla.Structures.CatalogInternal.ImportEntry
The structure for specifying the source data of the shape to be imported.

Tekla.Structures.CatalogInternal.ImportEntry.#ctor
Initializes a new instance of the Tekla.Structures.CatalogInternal.ImportEntry class.

Tekla.Structures.CatalogInternal.ImportEntry.FolderPath
Gets or sets the path to the folder where the files as the source for importing are stored.

Tekla.Structures.CatalogInternal.ImportEntry.EntryFileName
Gets or sets the name of the entry file from which the source for importing is extracted.

Tekla.Structures.CatalogInternal.ImportEntry.CoordinateSystem
Gets or sets the coordinate system.

Tekla.Structures.CatalogInternal.ImportEntry.Overwrite
Gets or sets a value indicating whether to override the existing shape in case
the given shape name already exists.

Tekla.Structures.CatalogInternal.ImportEntry.CreateCustomPart
Gets or sets a value indicating whether to create a custom part at import success.

Tekla.Structures.CatalogInternal.ImportEntry.ScalingFactor
Gets or sets the scaling factor

Tekla.Structures.CatalogInternal.ImportEntry.ToStruct
Creates an instance in internal struct.
Returns:
The Tekla.Structures.CatalogInternal.dotcatShapeImport_t.